Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.vm.open.terminalNotFound
source: %1$@ has no terminal '%2$@' in workspace '%3$@'. See: cmux vm tree %1$@
ar: لا يحتوي %1$@ على الطرفية '%2$@' في مساحة العمل '%3$@'. انظر: cmux vm tree %1$@
de: %1$@ hat kein Terminal „%2$@“ im Arbeitsbereich „%3$@“. Siehe: cmux vm tree %1$@
es: %1$@ no tiene ninguna terminal '%2$@' en el espacio de trabajo '%3$@'. Consulta: cmux vm tree %1$@
fr: %1$@ n'a pas de terminal '%2$@' dans l'espace de travail '%3$@'. Voir : cmux vm tree %1$@
ja: %1$@ にはターミナル '%2$@' が、ワークスペース '%3$@' 内にありません。以下を参照してください: cmux vm tree %1$@
ko: %1$@에는 터미널 '%2$@'(이)가 작업 공간 '%3$@' 안에 존재하지 않습니다. 참고: cmux vm tree %1$@
zh_hans: %1$@ 没有终端 '%2$@' 在工作区 '%3$@' 中。请参阅：cmux vm tree %1$@
zh_hant: %1$@ 沒有終端機 '%2$@'（位於工作區 '%3$@'）。請參閱：cmux vm tree %1$@

# cli.vm.open.terminalAmbiguous
source: Terminal '%2$@' on %1$@ has no unique tab in workspace '%3$@'. Use cmux vm tree %1$@ and choose an exact placement.
ar: الطرفية '%2$@' على %1$@ ليس لها علامة تبويب فريدة في مساحة العمل '%3$@'. استخدم cmux vm tree %1$@ واختر موضعًا دقيقًا.
de: Das Terminal „%2$@“ auf %1$@ hat keinen eindeutigen Tab im Arbeitsbereich „%3$@“. Verwenden Sie cmux vm tree %1$@ und wählen Sie eine genaue Platzierung.
es: La terminal '%2$@' en %1$@ no tiene una pestaña única en el espacio de trabajo '%3$@'. Utiliza cmux vm tree %1$@ y elige una ubicación exacta.
fr: Le terminal '%2$@' sur %1$@ n'a pas d'onglet unique dans l'espace de travail '%3$@'. Utilisez cmux vm tree %1$@ et choisissez un emplacement exact.
ja: ターミナル '%2$@'（%1$@ 上）には、ワークスペース '%3$@' 内に一意のタブがありません。cmux vm tree %1$@ を使用して、正確な配置を指定してください。
ko: 터미널 '%2$@'은(는) %1$@에서 작업 공간 '%3$@' 내에 고유한 탭을 가지고 있지 않습니다. cmux vm tree %1$@을(를) 사용하여 정확한 위치를 선택하십시오.
zh_hans: 终端 '%2$@'（在 %1$@ 上）在工作区 '%3$@' 中没有唯一的标签页。使用 cmux vm tree %1$@ 并选择精确的放置位置。
zh_hant: 終端機 '%2$@'（位於 %1$@ 上）在工作區 '%3$@' 中沒有唯一的標籤頁。請使用 cmux vm tree %1$@ 並選擇確切的位置。

# cli.vm.open.terminalUnavailable
source: Terminal placement for %1$@ is unavailable. Reconnect and retry.
ar: موضع الطرفية لـ %1$@ غير متاح. أعد الاتصال وأعد المحاولة.
de: Terminal-Platzierung für %1$@ ist nicht verfügbar. Verbinden Sie sich erneut und versuchen Sie es noch einmal.
es: La ubicación de la terminal para %1$@ no está disponible. Reconéctate e inténtalo de nuevo.
fr: L'emplacement du terminal pour %1$@ n'est pas disponible. Reconnectez-vous et réessayez.
ja: %1$@ のターミナル配置を取得できません。再接続してから再試行してください。
ko: %1$@의 터미널 위치 배치를 사용할 수 없습니다. 다시 연결한 후 시도하십시오.
zh_hans: %1$@ 的终端位置不可用。请重新连接后重试。
zh_hant: %1$@ 的終端機配置無法使用。請重新連線並重試。

# cli.vm.route.wouldProvision
source: No pool machine is free for %@ — `cmux vm run` would provision a fresh one (add --provision to create it now).
ar: لا يوجد جهاز متاح من التجمع لـ %@ — سيقوم `cmux vm run` بتهيئة جهاز جديد (أضف --provision لإنشائه الآن).
de: Keine Pool-Maschine ist frei für %@ – `cmux vm run` würde eine neue bereitstellen (fügen Sie --provision hinzu, um sie jetzt zu erstellen).
es: Ninguna máquina del grupo está libre para %@ — `cmux vm run` aprovisionaría una nueva (añade --provision para crearla ahora).
fr: Aucune machine du pool n'est libre pour %@ — `cmux vm run` provisionnerait une nouvelle machine (ajoutez --provision pour la créer maintenant).
ja: %@ 用に空いているプールマシンがありません — `cmux vm run` は新しいマシンを作成します（今すぐ作成するには --provision を付けてください）。
ko: %@에 대해 사용할 수 있는 풀 가상 머신이 없습니다 — `cmux vm run` 실행 시 새 가상 머신이 프로비저닝됩니다 (지금 생성하려면 --provision을 추가하십시오).
zh_hans: 没有空闲的池化机器可供 %@ 使用 —— `cmux vm run` 会新开一台（加 --provision 可立即创建）。
zh_hant: 沒有空閒的集區機器可用於 %@ — `cmux vm run` 將會部署一台新的機器（加入 --provision 以立即建立）。

# cli.vm.agent.started
source: Started %1$@ on %2$@ — terminal %3$@ in workspace %4$@ (detached: it keeps running if the pane closes).
ar: تم تشغيل %1$@ على %2$@ — الطرفية %3$@ في مساحة العمل %4$@ (منفصل: يستمر في العمل إذا تم إغلاق الجزء).
de: %1$@ auf %2$@ gestartet – Terminal %3$@ im Arbeitsbereich %4$@ (getrennt: es läuft weiter, wenn das Teilfenster geschlossen wird).
es: Se inició %1$@ en %2$@ — terminal %3$@ en el espacio de trabajo %4$@ (desacoplada: sigue ejecutándose si el panel se cierra).
fr: %1$@ démarré sur %2$@ — terminal %3$@ dans l'espace de travail %4$@ (détaché : il continue de s'exécuter si le volet est fermé).
ja: %1$@ を %2$@ 上で起動しました — ターミナル %3$@（ワークスペース %4$@ 内）（デタッチ済み: ペインが閉じても実行を継続します）。
ko: %1$@을(를) %2$@에서 시작했습니다 — 터미널 %3$@ (작업 공간 %4$@ 내) (분리됨: 분할 창이 닫혀도 계속 실행됩니다).
zh_hans: 已启动 %1$@（在 %2$@ 上）——终端 %3$@（位于工作区 %4$@ 中）（已分离：如果窗格关闭，它将继续运行）。
zh_hant: 已啟動 %1$@（在 %2$@ 上）— 終端機 %3$@（位於工作區 %4$@，中斷連接：如果窗格關閉，它仍會繼續執行）。

# cli.vm.agent.reattach
source: Reattach: cmux vm open %1$@/%2$@/%3$@
ar: إعادة ربط: cmux vm open %1$@/%2$@/%3$@
de: Erneut verbinden: cmux vm open %1$@/%2$@/%3$@
es: Volver a acoplar: cmux vm open %1$@/%2$@/%3$@
fr: Se rattacher : cmux vm open %1$@/%2$@/%3$@
ja: 再接続: cmux vm open %1$@/%2$@/%3$@
ko: 다시 연결: cmux vm open %1$@/%2$@/%3$@
zh_hans: 重新挂载: cmux vm open %1$@/%2$@/%3$@
zh_hant: 重新連接：cmux vm open %1$@/%2$@/%3$@

# cli.vm.list.planMeter.single
source: %1$d of 1 machine on the %2$@ plan
ar: %1$d من أصل جهاز واحد في خطة %2$@
de: %1$d von 1 Maschine im %2$@-Tarif
es: %1$d de 1 máquina en el plan %2$@
fr: %1$d sur 1 machine du forfait %2$@
ja: %1$d 台 / 1 台（%2$@ プラン）
ko: %1$d대 사용 중 (총 1대, %2$@ 요금제)
zh_hans: %1$d 台 / 1 台机器（%2$@ 计划）
zh_hant: %1$d 台（共 1 台機器，採用 %2$@ 方案）

# cli.vm.list.freeAccess
source: Free cloud access expires in %1$@ (%2$@) — upgrade to keep using it: %3$@
ar: ينتهي الوصول السحابي المجاني خلال %1$@ (%2$@) — قم بالترقية لمواصلة استخدامه: %3$@
de: Kostenloser Cloud-Zugang läuft ab in %1$@ (%2$@) – führen Sie ein Upgrade durch, um ihn weiter zu nutzen: %3$@
es: El acceso gratuito a la nube expira en %1$@ (%2$@); mejora tu plan para seguir usándolo: %3$@
fr: L'accès cloud gratuit expire dans %1$@ (%2$@) — mettez à niveau pour continuer à l'utiliser : %3$@
ja: 無料クラウドアクセスは残り %1$@（%2$@）で終了します — 引き続き使うにはアップグレード: %3$@
ko: 무료 클라우드 액세스가 %1$@ 후 만료됩니다(%2$@) — 계속 사용하려면 업그레이드하십시오: %3$@
zh_hans: 免费云端访问将在 %1$@ 后到期（%2$@）—— 升级以继续使用：%3$@
zh_hant: 免費雲端存取權限將在 %1$@ (%2$@) 後過期 — 升級以繼續使用：%3$@

# cli.vm.list.freeAccessExpired
source: Free cloud access has expired — upgrade to reconnect: %1$@
ar: انتهت صلاحية الوصول السحابي المجاني — قم بالترقية لإعادة الاتصال: %1$@
de: Der kostenlose Cloud-Zugang ist abgelaufen – führen Sie ein Upgrade durch, um die Verbindung wiederherzustellen: %1$@
es: El acceso gratuito a la nube ha expirado; mejora tu plan para reconectarte: %1$@
fr: L'accès cloud gratuit a expiré — mettez à niveau pour vous reconnecter : %1$@
ja: 無料クラウドアクセスは終了しました — 再接続するにはアップグレード: %1$@
ko: 무료 클라우드 액세스가 만료되었습니다 — 다시 연결하려면 업그레이드하십시오: %1$@
zh_hans: 免费云端访问已到期 —— 升级以重新连接：%1$@
zh_hant: 免費雲端存取權限已過期 — 升級以重新連線：%1$@

# cli.vm.pull.progress
source: cmux vm pull: %1$d/%d chunks
ar: cmux vm pull: %1$d من %d جزء
es: cmux vm pull: %1$d/%d fragmentos
fr: cmux vm pull: %1$d/%d blocs
ja: cmux vm pull: %1$d/%d チャンク
ko: cmux vm pull: %1$d/%d 청크
zh_hans: cmux vm pull: %1$d/%d 个分块
zh_hant: cmux vm pull: %1$d/%d 個區塊

# cli.vm.pull.summary
source: Pulled %1$@:%2$@ to %3$@ (%4$@)
ar: تم سحب %1$@:%2$@ إلى %3$@ (%4$@)
de: %1$@:%2$@ nach %3$@ heruntergeladen (%4$@)
es: Descargado %1$@:%2$@ en %3$@ (%4$@)
fr: Récupéré %1$@:%2$@ vers %3$@ (%4$@)
ja: %1$@:%2$@ を %3$@ にプルしました（%4$@）
ko: %1$@:%2$@을(를) %3$@로 가져왔습니다 (%4$@)
zh_hans: 已将 %1$@:%2$@ 拉取到 %3$@（%4$@）
zh_hant: 已將 %1$@:%2$@ 拉取至 %3$@ (%4$@)

# cli.vm.push.excludedNote
source: Skipped: %1$@ (pass --no-default-excludes to send everything)
ar: تم التخطي: %1$@ (مرر --no-default-excludes لإرسال كل شيء)
de: Übersprungen: %1$@ (übergeben Sie --no-default-excludes, um alles zu senden)
es: Omitido: %1$@ (pasa --no-default-excludes para enviar todo)
fr: Ignoré : %1$@ (passez --no-default-excludes pour tout envoyer)
ja: スキップ: %1$@（すべて送るには --no-default-excludes を指定）
ko: 건너뜀: %1$@ (모두 보내려면 --no-default-excludes를 전달하십시오)
zh_hans: 已跳过: %1$@（传入 --no-default-excludes 可发送全部内容）
zh_hant: 已跳過：%1$@（傳遞 --no-default-excludes 以傳送所有內容）

# cli.vm.push.progress
source: cmux vm push: %1$d/%d chunks
ar: cmux vm push: %1$d/%d مقطع
es: cmux vm push: %1$d/%d fragmentos
fr: cmux vm push : %1$d/%d segments
ja: cmux vm push: %1$d/%d チャンク
ko: cmux vm push: %1$d/%d 청크
zh_hans: cmux vm push: %1$d/%d 个分块
zh_hant: cmux vm push: %1$d/%d 個區塊

# cli.vm.push.summary
source: Pushed %1$@ to %2$@:%3$@ (%4$@)
ar: تم دفع %1$@ إلى %2$@:%3$@ (%4$@)
de: %1$@ nach %2$@:%3$@ hochgeladen (%4$@)
es: Enviado %1$@ a %2$@:%3$@ (%4$@)
fr: Envoyé %1$@ vers %2$@:%3$@ (%4$@)
ja: %1$@ を %2$@:%3$@ にプッシュしました（%4$@）
ko: %1$@을(를) %2$@:%3$@로 전송했습니다 (%4$@)
zh_hans: 已将 %1$@ 推送到 %2$@:%3$@（%4$@）
zh_hant: 已將 %1$@ 推送至 %2$@:%3$@ (%4$@)

# cli.vm.reconnecting
source: [cmux] connection lost — reconnecting (attempt %d)…
ar: [cmux] انقطع الاتصال — جاري إعادة الاتصال (المحاولة %d)…
de: [cmux] Verbindung verloren — Verbindung wird wiederhergestellt (Versuch %d)…
es: [cmux] conexión perdida — reconectando (intento %d)…
fr: [cmux] connexion perdue — reconnexion (tentative %d)…
ja: [cmux] 接続が切断されました — 再接続中（試行 %d）…
ko: [cmux] 연결이 끊겼습니다 — 다시 연결하는 중입니다 (시도 횟수: %d)…
zh_hans: [cmux] 连接已断开 —— 正在重连（第 %d 次尝试）…
zh_hant: [cmux] 連線中斷 — 正在重新連線（第 %d 次嘗試）…

# cli.vm.rename.cleared
source: %@ label cleared
ar: تم مسح تسمية %@
de: Kennzeichnung für %@ gelöscht
es: Etiqueta de %@ eliminada
fr: Libellé %@ effacé
ja: %@ のラベルを削除しました
ko: %@ 레이블이 삭제되었습니다
zh_hans: %@ 的标签已清除
zh_hant: 已清除 %@ 標籤

# cli.vm.rename.set
source: %1$@ is now labeled “%2$@”
ar: تمت تسمية %1$@ الآن بـ “%2$@”
de: %1$@ ist jetzt als „%2$@“ gekennzeichnet
es: %1$@ ahora está etiquetado como “%2$@”
fr: %1$@ est désormais libellé « %2$@ »
ja: %1$@ のラベルを“%2$@”に設定しました
ko: 이제 %1$@의 레이블은 “%2$@”입니다
zh_hans: %1$@ 现已标记为“%2$@”
zh_hant: %1$@ 的標籤現在已設為「%2$@」

# cli.vm.rename.usage
source: Usage: cmux vm rename <id> <new-label> cmux vm rename <id> --clear The label is display-only; the machine id stays its address. Find an id: cmux vm ls
ar: الاستخدام: cmux vm rename <id> <new-label> cmux vm rename <id> --clear التسمية مخصصة للعرض فقط؛ ويظل معرّف الجهاز هو عنوانه. العثور على معرّف: cmux vm ls
de: Verwendung: cmux vm rename <ID> <neues-Label> cmux vm rename <ID> --clear Das Label dient nur zur Anzeige; die Maschinen-ID bleibt die Adresse. Eine ID finden: cmux vm ls
es: Uso: cmux vm rename <id> <new-label> cmux vm rename <id> --clear La etiqueta es solo de visualización; el ID de la máquina sigue siendo su dirección. Buscar un ID: cmux vm ls
fr: Utilisation : cmux vm rename <id> <nouvelle-étiquette> cmux vm rename <id> --clear L’étiquette est uniquement destinée à l’affichage ; l’ID de la machine reste son adresse. Trouver un ID : cmux vm ls
ja: 使い方: cmux vm rename <id> <new-label> cmux vm rename <id> --clear ラベルは表示専用です。マシンのアドレスは id のままです。 id の確認: cmux vm ls
ko: 사용법: cmux vm rename <id> <new-label> cmux vm rename <id> --clear 레이블은 표시용일 뿐이며, 가상 머신 ID는 해당 주소로 유지됩니다. ID를 찾는 방법: cmux vm ls
zh_hans: 用法：cmux vm rename <id> <new-label> cmux vm rename <id> --clear 标签仅用于显示；机器 id 仍是它的地址。 查找 id: cmux vm ls
zh_hant: 用法: cmux vm rename <id> <new-label> cmux vm rename <id> --clear 此標籤僅供顯示；機器 id 仍是其位址。 尋找 id： cmux vm ls

# cli.vm.tui.clientExited
source: cmux-tui exited with status %1$d. Re-run `cmux vm tui %2$@` to reconnect.
ar: خرج cmux-tui بالحالة %1$d. أعد تشغيل `cmux vm tui %2$@` لإعادة الاتصال.
de: cmux-tui wurde mit Status %1$d beendet. Führen Sie `cmux vm tui %2$@` erneut aus, um die Verbindung wiederherzustellen.
es: cmux-tui finalizó con el estado de salida %1$d. Vuelve a ejecutar `cmux vm tui %2$@` para reconectarte.
fr: cmux-tui s'est terminé avec le statut %1$d. Réexécutez `cmux vm tui %2$@` pour vous reconnecter.
ja: cmux-tui がステータス %1$d で終了しました。再接続するには `cmux vm tui %2$@` を再実行してください。
ko: cmux-tui가 종료 코드 %1$d(으)로 종료되었습니다. 다시 연결하려면 `cmux vm tui %2$@`을(를) 다시 실행하십시오.
zh_hans: cmux-tui 以状态码 %1$d 退出。重新运行 `cmux vm tui %2$@` 可重连。
zh_hant: cmux-tui 已結束，結束狀態碼為 %1$d。請重新執行 `cmux vm tui %2$@` 以重新連線。

# cli.vm.tui.clientMissingSearched
source: No cmux-tui client found (searched: %1$@). Install one with `curl -fsSL https://cmux.com/tui/install-static.sh | sh`, or point CMUX_TUI_CLIENT at a binary.
ar: لم يتم العثور على عميل cmux-tui (تم البحث في: %1$@). قم بتثبيت واحد باستخدام `curl -fsSL https://cmux.com/tui/install-static.sh | sh`، أو وجه المتغير CMUX_TUI_CLIENT إلى ملف ثنائي.
de: Kein cmux-tui-Client gefunden (gesucht: %1$@). Installieren Sie einen mit `curl -fsSL https://cmux.com/tui/install-static.sh | sh` oder verweisen Sie mit CMUX_TUI_CLIENT auf eine Binärdatei.
es: No se encontró ningún cliente cmux-tui (buscado en: %1$@). Instala uno con `curl -fsSL https://cmux.com/tui/install-static.sh | sh`, o apunta CMUX_TUI_CLIENT a un binario.
fr: Aucun client cmux-tui trouvé (recherché dans : %1$@). Installez-en un avec `curl -fsSL https://cmux.com/tui/install-static.sh | sh`, ou faites pointer CMUX_TUI_CLIENT vers un binaire.
ja: cmux-tui クライアントが見つかりません（検索したパス: %1$@）。`curl -fsSL https://cmux.com/tui/install-static.sh | sh` でインストールするか、CMUX_TUI_CLIENT にバイナリを指定してください。
ko: cmux-tui 클라이언트를 찾을 수 없습니다(검색 경로: %1$@). `curl -fsSL https://cmux.com/tui/install-static.sh | sh` 명령으로 설치하거나 CMUX_TUI_CLIENT 환경 변수가 바이너리를 가리키도록 설정하십시오.
zh_hans: 未找到 cmux-tui 客户端（已查找：%1$@）。用 `curl -fsSL https://cmux.com/tui/install-static.sh | sh` 安装一个，或把 CMUX_TUI_CLIENT 指向某个二进制文件。
zh_hant: 找不到 cmux-tui 用戶端（搜尋路徑：%1$@）。請使用 `curl -fsSL https://cmux.com/tui/install-static.sh | sh` 安裝，或將 CMUX_TUI_CLIENT 指向執行檔。

# cli.vm.tui.connecting
source: Connecting to %1$@ through cmux-tui…
ar: جاري الاتصال بـ %1$@ عبر cmux-tui…
de: Verbindung mit %1$@ über cmux-tui wird hergestellt…
es: Conectando a %1$@ a través de cmux-tui…
fr: Connexion à %1$@ via cmux-tui…
ja: cmux-tui 経由で %1$@ に接続しています…
ko: cmux-tui를 통해 %1$@에 연결하는 중입니다…
zh_hans: 正在通过 cmux-tui 连接到 %1$@…
zh_hant: 正在透過 cmux-tui 連線至 %1$@…

# cli.vm.tui.trustedListenerPending
source: The Cloud machine is still preparing remote access. Try again shortly.
ar: لا يزال الجهاز السحابي يجهز الوصول عن بعد. حاول مجددًا بعد قليل.
de: Die Cloud-Maschine bereitet den Remote-Zugriff noch vor. Versuchen Sie es in Kürze noch einmal.
es: La máquina en la nube aún está preparando el acceso remoto. Inténtalo de nuevo en breve.
fr: La machine Cloud prépare toujours l’accès distant. Réessayez dans quelques instants.
ja: クラウドマシンはまだリモートアクセスを準備中です。しばらくしてからもう一度お試しください。
ko: 클라우드 가상 머신이 아직 원격 액세스를 준비 중입니다. 잠시 후 다시 시도하십시오.
zh_hans: 云端机器仍在准备远程访问。请稍后重试。
zh_hant: 雲端機器仍在準備遠端存取。請稍後重試。

# cli.vm.tui.mode.carrier
source: private network trust
ar: ثقة الشبكة الخاصة
de: Vertrauen in privates Netzwerk
es: confianza de red privada
fr: confiance réseau privé
ja: プライベートネットワークの信頼
ko: 사설 네트워크 신뢰
zh_hans: 私有网络信任
zh_hant: 私有網路信任

# cli.vm.tui.mode.enrolled
source: device already enrolled
ar: الجهاز مسجل بالفعل
de: Gerät bereits registriert
es: dispositivo ya registrado
fr: appareil déjà inscrit
ja: このデバイスは登録済みです
ko: 기기가 이미 등록됨
zh_hans: 设备已注册
zh_hant: 裝置已註冊

# cli.vm.tui.opened
source: Opened cmux-tui for %1$@ (%2$@)
ar: تم فتح cmux-tui لـ %1$@ (%2$@)
de: cmux-tui für %1$@ geöffnet (%2$@)
es: Se abrió cmux-tui para %1$@ (%2$@)
fr: cmux-tui ouvert pour %1$@ (%2$@)
ja: %1$@ の cmux-tui を開きました（%2$@）
ko: %1$@에 대한 cmux-tui를 열었습니다 (%2$@)
zh_hans: 已为 %1$@ 打开 cmux-tui（%2$@）
zh_hant: 已為 %1$@ 開啟 cmux-tui (%2$@)

# cli.vm.tui.protocolMismatch
source: cmux-tui protocol mismatch: client %1$@ speaks protocol %2$d, the machine daemon %3$@ speaks protocol %4$d. %5$@
ar: عدم تطابق بروتوكول cmux-tui: العميل %1$@ يتحدث بروتوكول %2$d، بينما برنامج الخلفية للجهاز %3$@ يتحدث بروتوكول %4$d. %5$@
de: cmux-tui-Protokollkonflikt: Client %1$@ spricht Protokoll %2$d, der Maschinen-Daemon %3$@ spricht Protokoll %4$d. %5$@
es: Incompatibilidad de protocolo cmux-tui: el cliente %1$@ habla el protocolo %2$d, el demonio de la máquina %3$@ habla el protocolo %4$d. %5$@
fr: Incompatibilité de protocole cmux-tui : le client %1$@ utilise le protocole %2$d, le démon de la machine %3$@ utilise le protocole %4$d. %5$@
ja: cmux-tui のプロトコルが一致しません: クライアント %1$@ はプロトコル %2$d、マシンのデーモン %3$@ はプロトコル %4$d です。%5$@
ko: cmux-tui 프로토콜 불일치: 클라이언트 %1$@은(는) 프로토콜 %2$d을(를) 사용하지만 가상 머신 데몬 %3$@은(는) 프로토콜 %4$d을(를) 사용합니다. %5$@
zh_hans: cmux-tui 协议不匹配：客户端 %1$@ 使用协议 %2$d，机器守护进程 %3$@ 使用协议 %4$d。%5$@
zh_hant: cmux-tui 協定不符：用戶端 %1$@ 使用協定 %2$d，而機器精靈程序 %3$@ 使用協定 %4$d。%5$@

# cli.vm.tui.staleClient
source: Update cmux (its bundled cmux-tui client is older than the machine's daemon).
ar: قم بتحديث cmux (عميل cmux-tui المدمج فيه أقدم من برنامج الخلفية للجهاز).
de: Aktualisieren Sie cmux (der mitgelieferte cmux-tui-Client ist älter als der Daemon der Maschine).
es: Actualiza cmux (su cliente cmux-tui integrado es más antiguo que el demonio de la máquina).
fr: Mettez à jour cmux (son client cmux-tui intégré est plus ancien que le démon de la machine).
ja: cmux を更新してください（同梱の cmux-tui クライアントがマシンのデーモンより古いです）。
ko: cmux를 업데이트하십시오 (기본 내장된 cmux-tui 클라이언트가 가상 머신의 데몬보다 오래되었습니다).
zh_hans: 请更新 cmux（它内置的 cmux-tui 客户端比机器上的守护进程旧）。
zh_hant: 請更新 cmux（其隨附的 cmux-tui 用戶端版本比機器的精靈程序舊）。

# cli.vm.tui.staleDaemon
source: The machine's cmux-tui daemon is older than this client; reconnect once the machine has updated.
ar: برنامج الخلفية cmux-tui للجهاز أقدم من هذا العميل؛ أعد الاتصال بمجرد تحديث الجهاز.
de: Der cmux-tui-Daemon der Maschine ist älter als dieser Client; verbinden Sie sich erneut, sobald die Maschine aktualisiert wurde.
es: El demonio cmux-tui de la máquina es más antiguo que este cliente; reconéctate una vez que la máquina se haya actualizado.
fr: Le démon cmux-tui de la machine est plus ancien que ce client ; reconnectez-vous une fois la machine mise à jour.
ja: マシンの cmux-tui デーモンがこのクライアントより古いです。マシンが更新されてから再接続してください。
ko: 가상 머신의 cmux-tui 데몬이 이 클라이언트보다 오래되었습니다. 가상 머신이 업데이트된 후 다시 연결하십시오.
zh_hans: 机器上的 cmux-tui 守护进程比此客户端旧；请等机器更新后再连接。
zh_hant: 機器的 cmux-tui 精靈程序版本比此用戶端舊；請在機器更新後重新連線。

# cli.vm.wait.ready
source: %1$@ is ready (%2$@) after %ds
ar: %1$@ جاهز (%2$@) بعد %d ثانية
de: %1$@ ist bereit (%2$@) nach %d Sekunden
es: %1$@ está listo (%2$@) después de %d segundos
fr: %1$@ est prêt (%2$@) après %ds
ja: %1$@は準備が整いました (%2$@) - %d秒後
ko: %1$@이(가) 준비되었습니다 (%2$@) — %d초 후
zh_hans: %1$@ 已就绪 (%2$@)，耗时 %d 秒
zh_hant: %1$@ 已就緒 (%2$@)，歷時 %d 秒

# cli.workspace.create.error.envFileRequiresValue
source: %@: --env-file requires <path>
ar: %@: يتطلب --env-file تحديد <path>
de: %@: --env-file erfordert <Pfad>
es: %@: --env-file requiere <ruta>
fr: %@ : --env-file requiert <chemin>
ja: %@: --env-file には <path> が必要です
ko: %@: --env-file에는 <path>가 필요합니다
uk: %@: --env-file потребує <path>
zh_hans: %@：--env-file 需要 <path>
zh_hant: %@：--env-file 需要 <path>

# cli.workspace.create.error.envRequiresValue
source: %@: --env requires KEY=VALUE
ar: %@: يتطلب --env صيغة KEY=VALUE
de: %@: --env erfordert SCHLÜSSEL=WERT
es: %@: --env requiere CLAVE=VALOR
fr: %@ : --env requiert CLÉ=VALEUR
ja: %@: --env には KEY=VALUE が必要です
ko: %@: --env에는 KEY=VALUE가 필요합니다
uk: %@: --env потребує KEY=VALUE
zh_hans: %@：--env 需要 KEY=VALUE
zh_hant: %@：--env 需要 KEY=VALUE

# cli.workspace.create.error.unknownFlag
source: %@: unknown flag '%@'. Known flags: --name <title>, --description <text>, --command <text>, --cwd <path>, --env KEY=VALUE, --env-file <path>, --layout <json>, --window <id|ref|index>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>
ar: %@: علامة غير معروفة '%@'. العلامات المعروفة: --name <title>، --description <text>، --command <text>، --cwd <path>، --env KEY=VALUE، --env-file <path>، --layout <json>، --window <id|ref|index>، --focus <true|false>، --group <id|ref>، --group-placement <afterCurrent|top|end>، --group-reference <workspace>
de: %@: unbekanntes Flag „%@“. Bekannte Flags: --name <title>, --description <text>, --command <text>, --cwd <path>, --env KEY=VALUE, --env-file <path>, --layout <json>, --window <id|ref|index>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>
es: %@: opción desconocida '%@'. Opciones conocidas: --name <título>, --description <texto>, --command <texto>, --cwd <ruta>, --env CLAVE=VALOR, --env-file <ruta>, --layout <json>, --window <id|ref|índice>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>
fr: %@ : option inconnue '%@'. Options connues : --name <title>, --description <text>, --command <text>, --cwd <path>, --env KEY=VALUE, --env-file <path>, --layout <json>, --window <id|ref|index>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>
ja: %@: 不明なフラグ '%@'。利用可能なフラグ: --name <title>, --description <text>, --command <text>, --cwd <path>, --env KEY=VALUE, --env-file <path>, --layout <json>, --window <id|ref|index>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>
ko: %@: 알 수 없는 플래그 '%@'. 사용 가능한 플래그: --name <title>, --description <text>, --command <text>, --cwd <path>, --env KEY=VALUE, --env-file <path>, --layout <json>, --window <id|ref|index>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>
uk: %@: невідомий прапорець '%@'. Доступні прапорці: --name <title>, --description <text>, --command <text>, --cwd <path>, --env KEY=VALUE, --env-file <path>, --layout <json>, --window <id|ref|index>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>
zh_hans: %@：未知标志 '%@'。已知标志：--name <title>、--description <text>、--command <text>、--cwd <path>、--env KEY=VALUE、--env-file <path>、--layout <json>、--window <id|ref|index>、--focus <true|false>、--group <id|ref>、--group-placement <afterCurrent|top|end>、--group-reference <workspace>
zh_hant: %@：未知的旗標 '%@'。選用旗標：--name <title>, --description <text>, --command <text>, --cwd <path>, --env KEY=VALUE, --env-file <path>, --layout <json>, --window <id|ref|index>, --focus <true|false>, --group <id|ref>, --group-placement <afterCurrent|top|end>, --group-reference <workspace>

# cli.workspace.env.empty
source: No environment variables
ar: لا توجد متغيرات بيئية
de: Keine Umgebungsvariablen
es: No hay variables de entorno
fr: Aucune variable d’environnement
ja: 環境変数はありません
ko: 환경 변수가 없습니다
uk: Немає змінних середовища
zh_hans: 没有环境变量
zh_hant: 無環境變數

# cli.workspace.env.error.emptyKey
source: %@: %@ entry '%@' has an empty key
ar: %@: إدخال %@ '%@' يحتوي على مفتاح فارغ
de: %@: %@-Eintrag „%@“ hat einen leeren Schlüssel
es: %@: la entrada %@ '%@' tiene una clave vacía
fr: %@ : l'entrée %@ '%@' a une clé vide
ja: %@: %@ のエントリ '%@' のキーが空です
ko: %@: %@ 항목 '%@'의 키가 비어 있습니다
uk: %@: запис %@ '%@' має порожній ключ
zh_hans: %@：%@ 条目 '%@' 的 key 为空
zh_hant: %@：%@ 項目 '%@' 的鍵值為空

# cli.workspace.env.error.invalidAssignment
source: %@: %@ entry '%@' must be in KEY=VALUE form
ar: %@: إدخال %@ '%@' يجب أن يكون بصيغة KEY=VALUE
de: %@: %@-Eintrag „%@“ muss im Format SCHLÜSSEL=WERT vorliegen
es: %@: la entrada %@ '%@' debe tener la forma CLAVE=VALOR
fr: %@ : l'entrée %@ '%@' doit être sous la forme CLÉ=VALEUR
ja: %@: %@ のエントリ '%@' は KEY=VALUE 形式である必要があります
ko: %@: %@ 항목 '%@'은(는) KEY=VALUE 형식이어야 합니다
uk: %@: запис %@ '%@' має бути у форматі KEY=VALUE
zh_hans: %@：%@ 条目 '%@' 必须为 KEY=VALUE 形式
zh_hant: %@：%@ 項目 '%@' 必須為 KEY=VALUE 格式
